window.$config = {
  /** ***********************************************************/
  /*                          通用配置                          */
  /** ***********************************************************/

  // Iconfont ，html中注入，如果私有部署，建议存放本地(assets/iconfont)，可修改main.js
  iconfont: {
    useCDN: true,
  },
  // Axios相关配置
  axios: {
    // 请求超时时间
    timeout: 10000,
    // 业务层（非协议层）接口定义的成功码
    successCode: [0, 200],
  },
  // 数据默认存放位置 cookie/sessionStorage/localStorage(默认)
  storage: '',
  // 基本的api地址 > env配置
  baseApiUrl: '',
  /** ***********************************************************/
  /*                     mobile端，相关配置                     */
  /** ***********************************************************/
  // 是否适配移动端
  enableMobileAdaptation: true,

  /** ***********************************************************/
  /*                       pc端，相关配置                       */
  /** ***********************************************************/
};
